{
  "0": "black",
  "1": "blue",
  "2": "red",
  "3": "green",
  "4": "yellow",
  "5": "gray",
  "6": "magenta",
  "7": "orange",
  "8": "cyan",
  "9": "maroon",
  "10": "END_ROW",
  "11": "STR_GRID",
  "12": "END_GRID",
  "13": "STR_SEQ",
  "14": "END_SEQ",
  "15": "INPUT_IND",
  "16": "OUTPUT_IND",
  "17": "STR_EXS",
  "18": "END_EXS",
  "19": "PAD",
  "20": [
    0,
    0
  ],
  "21": [
    20,
    20
  ],
  "22": [
    1,
    1
  ],
  "23": [
    3,
    3
  ],
  "24": [
    8,
    8
  ],
  "25": [
    4,
    4
  ],
  "26": [
    21,
    21
  ],
  "27": [
    2,
    2
  ],
  "28": [
    20,
    0
  ],
  "29": [
    5,
    5
  ],
  "30": [
    23,
    23
  ],
  "31": [
    24,
    24
  ],
  "32": [
    25,
    25
  ],
  "33": [
    1,
    2
  ],
  "34": [
    9,
    9
  ],
  "35": [
    6,
    6
  ],
  "36": [
    27,
    27
  ],
  "37": [
    21,
    0
  ],
  "38": [
    4,
    20
  ],
  "39": [
    7,
    7
  ],
  "40": [
    29,
    29
  ],
  "41": [
    2,
    0
  ],
  "42": [
    126,
    26
  ],
  "43": [
    30,
    30
  ],
  "44": [
    8,
    0
  ],
  "45": [
    31,
    31
  ],
  "46": [
    3,
    0
  ],
  "47": [
    32,
    32
  ],
  "48": [
    1,
    0
  ],
  "49": [
    4,
    5
  ],
  "50": [
    4,
    0
  ],
  "51": [
    5,
    0
  ],
  "52": [
    38,
    38
  ],
  "53": [
    3,
    28
  ],
  "54": [
    34,
    34
  ],
  "55": [
    8,
    20
  ],
  "56": [
    33,
    33
  ],
  "57": [
    8,
    28
  ],
  "58": [
    33,
    5
  ],
  "59": [
    5,
    20
  ],
  "60": [
    33,
    3
  ],
  "61": [
    23,
    3
  ],
  "62": [
    5,
    28
  ],
  "63": [
    126,
    28
  ],
  "64": [
    25,
    4
  ],
  "65": [
    12,
    16
  ],
  "66": [
    1,
    8
  ],
  "67": [
    2,
    3
  ],
  "68": [
    1,
    4
  ],
  "69": [
    3,
    20
  ],
  "70": [
    7,
    0
  ],
  "71": [
    36,
    36
  ],
  "72": [
    35,
    35
  ],
  "73": [
    8,
    10
  ],
  "74": [
    49,
    6
  ],
  "75": [
    6,
    3
  ],
  "76": [
    26,
    0
  ],
  "77": [
    330,
    330
  ],
  "78": [
    1,
    6
  ],
  "79": [
    53,
    53
  ],
  "80": [
    1,
    5
  ],
  "81": [
    126,
    20
  ],
  "82": [
    2,
    10
  ],
  "83": [
    56,
    56
  ],
  "84": [
    4,
    10
  ],
  "85": [
    26,
    20
  ],
  "86": [
    30,
    3
  ],
  "87": [
    29,
    0
  ],
  "88": [
    12,
    15
  ],
  "89": [
    270,
    0
  ],
  "90": [
    6,
    5
  ],
  "91": [
    45,
    45
  ],
  "92": [
    2,
    60
  ],
  "93": [
    55,
    55
  ],
  "94": [
    7,
    20
  ],
  "95": [
    4,
    3
  ],
  "96": [
    75,
    67
  ],
  "97": [
    74,
    58
  ],
  "98": [
    47,
    47
  ],
  "99": [
    63,
    63
  ],
  "100": [
    49,
    92
  ],
  "101": [
    24,
    8
  ],
  "102": [
    26,
    2338
  ],
  "103": [
    29,
    5
  ],
  "104": [
    6,
    0
  ],
  "105": [
    68,
    78
  ],
  "106": [
    2,
    58
  ],
  "107": [
    40,
    40
  ],
  "108": [
    39,
    39
  ],
  "109": [
    30,
    23
  ],
  "110": [
    126,
    2330
  ],
  "111": [
    57,
    57
  ],
  "112": [
    43,
    43
  ],
  "113": [
    35,
    6
  ],
  "114": [
    42,
    0
  ],
  "115": [
    26,
    28
  ],
  "116": [
    4,
    28
  ],
  "117": [
    10,
    3
  ],
  "118": [
    42,
    28
  ],
  "119": [
    22,
    48
  ],
  "120": [
    52,
    52
  ],
  "121": [
    5,
    3
  ],
  "122": [
    97,
    97
  ],
  "123": [
    6753,
    105
  ],
  "124": [
    7,
    8
  ],
  "125": [
    100,
    100
  ],
  "126": [
    44,
    44
  ],
  "127": [
    13,
    17
  ],
  "128": [
    127,
    15
  ],
  "129": [
    18,
    15
  ],
  "130": [
    1,
    3
  ],
  "131": [
    2332226,
    26
  ],
  "132": [
    47,
    32
  ],
  "133": [
    29,
    20
  ],
  "134": [
    4677,
    4677
  ],
  "135": [
    48,
    48
  ],
  "136": [
    2332226,
    2332226
  ],
  "137": [
    46,
    46
  ],
  "138": [
    2,
    7
  ],
  "139": [
    42,
    2330
  ],
  "140": [
    50,
    50
  ],
  "141": [
    65,
    1336
  ],
  "142": [
    6,
    20
  ],
  "143": [
    12,
    129
  ],
  "144": [
    2,
    8
  ],
  "145": [
    4,
    76
  ],
  "146": [
    2,
    6
  ],
  "147": [
    266,
    266
  ],
  "148": [
    22226,
    26
  ],
  "149": [
    10,
    5
  ],
  "150": [
    29,
    7
  ],
  "151": [
    1,
    86
  ],
  "152": [
    30,
    8
  ],
  "153": [
    42,
    102
  ],
  "154": [
    12757,
    12757
  ],
  "155": [
    64,
    8
  ],
  "156": [
    4,
    23
  ],
  "157": [
    9,
    0
  ],
  "158": [
    24,
    73
  ],
  "159": [
    114,
    114
  ],
  "160": [
    10,
    8
  ],
  "161": [
    3348,
    3348
  ],
  "162": [
    7,
    6
  ],
  "163": [
    77,
    77
  ],
  "164": [
    118,
    118
  ],
  "165": [
    130,
    5
  ],
  "166": [
    123,
    123
  ],
  "167": [
    10,
    43
  ],
  "168": [
    131,
    131
  ],
  "169": [
    1102,
    1102
  ],
  "170": [
    25,
    50
  ],
  "171": [
    4,
    27
  ],
  "172": [
    96,
    90
  ],
  "173": [
    121,
    138
  ],
  "174": [
    153,
    153
  ],
  "175": [
    26,
    2330
  ],
  "176": [
    8,
    3
  ],
  "177": [
    1,
    7
  ],
  "178": [
    90,
    6
  ],
  "179": [
    337,
    95
  ],
  "180": [
    5,
    4
  ],
  "181": [
    139,
    139
  ],
  "182": [
    10,
    112
  ],
  "183": [
    73,
    24
  ],
  "184": [
    110,
    110
  ],
  "185": [
    124,
    5
  ],
  "186": [
    128,
    120
  ],
  "187": [
    42,
    20
  ],
  "188": [
    2,
    5
  ],
  "189": [
    80,
    3
  ],
  "190": [
    7,
    180
  ],
  "191": [
    6737,
    173
  ],
  "192": [
    6,
    146
  ],
  "193": [
    2,
    150
  ],
  "194": [
    8,
    2330
  ],
  "195": [
    81,
    81
  ],
  "196": [
    7,
    58
  ],
  "197": [
    23,
    46
  ],
  "198": [
    10,
    6
  ],
  "199": [
    193,
    179
  ],
  "200": [
    196,
    190
  ],
  "201": [
    151,
    151
  ],
  "202": [
    60,
    192
  ],
  "203": [
    96,
    96
  ],
  "204": [
    2,
    4
  ],
  "205": [
    5,
    6
  ],
  "206": [
    148,
    148
  ],
  "207": [
    241,
    241
  ],
  "208": [
    113,
    79
  ],
  "209": [
    176,
    176
  ],
  "210": [
    93,
    93
  ],
  "211": [
    4,
    26
  ],
  "212": [
    10,
    40
  ],
  "213": [
    185,
    185
  ],
  "214": [
    29,
    28
  ],
  "215": [
    21,
    9
  ],
  "216": [
    1443,
    83
  ],
  "217": [
    8,
    23
  ],
  "218": [
    43,
    3
  ],
  "219": [
    2757,
    42
  ],
  "220": [
    172,
    172
  ],
  "221": [
    66,
    1440
  ],
  "222": [
    106,
    199
  ],
  "223": [
    60,
    74
  ],
  "224": [
    94,
    7
  ],
  "225": [
    40,
    0
  ],
  "226": [
    44,
    250
  ],
  "227": [
    120,
    3
  ],
  "228": [
    191,
    202
  ],
  "229": [
    67,
    200
  ],
  "230": [
    80,
    673
  ],
  "231": [
    61,
    20
  ],
  "232": [
    130130334,
    183
  ],
  "233": [
    10,
    46
  ],
  "234": [
    162,
    162
  ],
  "235": [
    9,
    20
  ],
  "236": [
    32,
    9
  ],
  "237": [
    216,
    83
  ],
  "238": [
    237,
    56
  ],
  "239": [
    24,
    44
  ],
  "240": [
    66,
    9
  ],
  "241": [
    1,
    9
  ],
  "242": [
    111,
    111
  ],
  "243": [
    205,
    78
  ],
  "244": [
    4,
    2259
  ],
  "245": [
    27,
    28
  ],
  "246": [
    27,
    2
  ],
  "247": [
    270,
    270
  ],
  "248": [
    57,
    12807
  ],
  "249": [
    219,
    219
  ],
  "250": [
    9,
    230
  ],
  "251": [
    9,
    33
  ],
  "252": [
    3,
    208
  ],
  "253": [
    5124,
    155
  ],
  "254": [
    6,
    28
  ],
  "255": [
    40,
    29
  ],
  "256": [
    189,
    66
  ],
  "257": [
    136,
    136
  ],
  "258": [
    99,
    63
  ],
  "259": [
    5,
    2338
  ],
  "260": [
    12130,
    26
  ],
  "261": [
    141,
    20
  ],
  "262": [
    2338,
    126
  ],
  "263": [
    70,
    270
  ],
  "264": [
    40,
    20
  ],
  "265": [
    25,
    10
  ],
  "266": [
    6,
    80
  ],
  "267": [
    251,
    1763
  ],
  "268": [
    40,
    5
  ],
  "269": [
    22241,
    331626
  ],
  "270": [
    106,
    49
  ],
  "271": [
    2,
    178
  ],
  "272": [
    7,
    150
  ],
  "273": [
    106,
    106
  ],
  "274": [
    3,
    37
  ],
  "275": [
    1336,
    26
  ],
  "276": [
    134,
    134
  ],
  "277": [
    673,
    266
  ],
  "278": [
    96,
    6
  ],
  "279": [
    2222,
    16
  ],
  "280": [
    147,
    266
  ],
  "281": [
    9,
    5
  ],
  "282": [
    109,
    46
  ],
  "283": [
    125,
    125
  ],
  "284": [
    220,
    238
  ],
  "285": [
    284,
    10
  ],
  "286": [
    166,
    123
  ],
  "287": [
    8,
    26
  ],
  "288": [
    22727272727275,
    131444
  ],
  "289": [
    10,
    107
  ],
  "290": [
    43,
    23
  ],
  "291": [
    260,
    15630
  ],
  "292": [
    137,
    137
  ],
  "293": [
    7,
    3
  ],
  "294": [
    187,
    187
  ],
  "295": [
    27,
    144
  ],
  "296": [
    165,
    7
  ],
  "297": [
    161,
    3348
  ],
  "298": [
    70,
    7
  ],
  "299": [
    81,
    145
  ],
  "300": [
    69,
    46
  ],
  "301": [
    10,
    9
  ],
  "302": [
    126,
    44
  ],
  "303": [
    41,
    120
  ],
  "304": [
    9,
    37
  ],
  "305": [
    4684,
    4684
  ],
  "306": [
    22226,
    22226
  ],
  "307": [
    10,
    109
  ],
  "308": [
    152,
    147
  ],
  "309": [
    1627373,
    229
  ],
  "310": [
    243,
    243
  ],
  "311": [
    250,
    9
  ],
  "312": [
    68,
    68
  ],
  "313": [
    64,
    288
  ],
  "314": [
    128,
    93
  ],
  "315": [
    74,
    1620
  ],
  "316": [
    1217,
    5
  ],
  "317": [
    5954,
    9
  ],
  "318": [
    9,
    8
  ],
  "319": [
    24,
    57
  ],
  "320": [
    41,
    270
  ],
  "321": [
    132,
    22727272727272714673
  ],
  "322": [
    154,
    154
  ],
  "323": [
    12386348,
    297
  ],
  "324": [
    130204,
    130204
  ],
  "325": [
    222,
    1627373
  ],
  "326": [
    108,
    108
  ],
  "327": [
    27,
    10
  ],
  "328": [
    128,
    4
  ],
  "329": [
    159,
    159
  ],
  "330": [
    2272771,
    21627
  ],
  "331": [
    330,
    71272782
  ],
  "332": [
    680,
    86
  ],
  "333": [
    679,
    271
  ],
  "334": [
    9,
    215
  ],
  "335": [
    181,
    181
  ],
  "336": [
    163,
    330
  ],
  "337": [
    256,
    277
  ],
  "338": [
    23,
    5
  ],
  "339": [
    174,
    174
  ],
  "340": [
    957,
    137
  ],
  "341": [
    7,
    28
  ],
  "342": [
    70,
    39
  ],
  "343": [
    9,
    236
  ],
  "344": [
    267,
    7531620
  ],
  "345": [
    2223124,
    308
  ],
  "346": [
    12803,
    252
  ],
  "347": [
    253,
    152054
  ],
  "348": [
    233222,
    16
  ],
  "349": [
    158,
    8
  ],
  "350": [
    740,
    740
  ],
  "351": [
    164,
    164
  ],
  "352": [
    113,
    10
  ],
  "353": [
    41213384,
    91
  ],
  "354": [
    8,
    112
  ],
  "355": [
    69,
    3
  ],
  "356": [
    272,
    9180
  ],
  "357": [
    2223124,
    280
  ],
  "358": [
    57,
    1266
  ],
  "359": [
    128,
    50
  ],
  "360": [
    80,
    80
  ],
  "361": [
    26,
    76
  ],
  "362": [
    119,
    119
  ],
  "363": [
    128,
    156
  ],
  "364": [
    54,
    54
  ],
  "365": [
    168,
    168
  ],
  "366": [
    23,
    244
  ],
  "367": [
    167,
    23
  ],
  "368": [
    10,
    7
  ],
  "369": [
    26,
    340
  ],
  "370": [
    122,
    97
  ],
  "371": [
    120,
    4
  ],
  "372": [
    225,
    366
  ],
  "373": [
    9,
    3
  ],
  "374": [
    41,
    23
  ],
  "375": [
    232,
    2673727272727272
  ],
  "376": [
    2272771771306272782,
    2272771771306272782
  ],
  "377": [
    331,
    331
  ],
  "378": [
    4,
    372
  ],
  "379": [
    220,
    172
  ],
  "380": [
    291,
    291
  ],
  "381": [
    8,
    12807
  ],
  "382": [
    99,
    99
  ],
  "383": [
    8,
    22688
  ],
  "384": [
    47,
    25
  ],
  "385": [
    152,
    152
  ],
  "386": [
    3144,
    3144
  ],
  "387": [
    98,
    13204
  ],
  "388": [
    22226,
    2757
  ],
  "389": [
    165,
    165
  ],
  "390": [
    65,
    148
  ],
  "391": [
    206,
    206
  ],
  "392": [
    128,
    1336
  ],
  "393": [
    45,
    160
  ],
  "394": [
    120,
    5
  ],
  "395": [
    25,
    278
  ],
  "396": [
    182043,
    61
  ],
  "397": [
    6,
    278
  ],
  "398": [
    84,
    58
  ],
  "399": [
    42,
    22220
  ],
  "400": [
    5,
    2330
  ],
  "401": [
    169,
    169
  ],
  "402": [
    75,
    10
  ],
  "403": [
    40,
    103
  ],
  "404": [
    313,
    313
  ],
  "405": [
    2220,
    91
  ],
  "406": [
    2272727272727272,
    232
  ],
  "407": [
    98,
    384
  ],
  "408": [
    120,
    24
  ],
  "409": [
    7,
    29
  ],
  "410": [
    141,
    26
  ],
  "411": [
    220,
    48
  ],
  "412": [
    8,
    76
  ],
  "413": [
    55,
    8
  ],
  "414": [
    270,
    270
  ],
  "415": [
    957,
    4
  ],
  "416": [
    301130130334,
    381
  ],
  "417": [
    128,
    23013
  ],
  "418": [
    35,
    720595
  ],
  "419": [
    418,
    208
  ],
  "420": [
    295,
    64
  ],
  "421": [
    122,
    121384
  ],
  "422": [
    421,
    220
  ],
  "423": [
    422,
    283
  ],
  "424": [
    423,
    7473
  ],
  "425": [
    424,
    149
  ],
  "426": [
    425,
    908
  ],
  "427": [
    426,
    370
  ],
  "428": [
    427,
    74
  ],
  "429": [
    428,
    573
  ],
  "430": [
    2,
    121
  ],
  "431": [
    9,
    28
  ],
  "432": [
    85,
    126
  ],
  "433": [
    149,
    4
  ],
  "434": [
    321,
    321
  ],
  "435": [
    405,
    45
  ],
  "436": [
    2,
    29
  ],
  "437": [
    369,
    27386
  ],
  "438": [
    88,
    1336
  ],
  "439": [
    334,
    215
  ],
  "440": [
    1304,
    9
  ],
  "441": [
    7,
    10
  ],
  "442": [
    189,
    189
  ],
  "443": [
    5954,
    61
  ],
  "444": [
    128,
    270
  ],
  "445": [
    8,
    4
  ],
  "446": [
    375,
    375
  ],
  "447": [
    70,
    38
  ],
  "448": [
    250,
    70
  ],
  "449": [
    143,
    1336
  ],
  "450": [
    8,
    85
  ],
  "451": [
    44,
    55
  ],
  "452": [
    75,
    75
  ],
  "453": [
    1170,
    8
  ],
  "454": [
    223,
    124
  ],
  "455": [
    24,
    55
  ],
  "456": [
    106,
    334
  ],
  "457": [
    456,
    80
  ],
  "458": [
    27,
    41
  ],
  "459": [
    57,
    416
  ],
  "460": [
    345,
    345
  ],
  "461": [
    7144,
    152
  ],
  "462": [
    461,
    266
  ],
  "463": [
    347,
    248
  ],
  "464": [
    228,
    222
  ],
  "465": [
    673,
    11162
  ],
  "466": [
    7,
    573
  ],
  "467": [
    466,
    173
  ],
  "468": [
    204,
    165
  ],
  "469": [
    128,
    7
  ],
  "470": [
    323,
    323
  ],
  "471": [
    201,
    201
  ],
  "472": [
    184,
    184
  ],
  "473": [
    65,
    1330
  ],
  "474": [
    120,
    8
  ],
  "475": [
    12330,
    12330
  ],
  "476": [
    121768,
    244
  ],
  "477": [
    251,
    251
  ],
  "478": [
    24,
    46
  ],
  "479": [
    98,
    132
  ],
  "480": [
    5,
    85
  ],
  "481": [
    195,
    195
  ],
  "482": [
    82,
    3
  ],
  "483": [
    69,
    1493
  ],
  "484": [
    406,
    406
  ],
  "485": [
    2293,
    7130
  ],
  "486": [
    1760,
    1219880
  ],
  "487": [
    486,
    61
  ],
  "488": [
    259,
    250
  ],
  "489": [
    223,
    60
  ],
  "490": [
    116,
    50
  ],
  "491": [
    4121334,
    73
  ],
  "492": [
    6,
    4
  ],
  "493": [
    10,
    23
  ],
  "494": [
    9,
    178
  ],
  "495": [
    5,
    10
  ],
  "496": [
    145,
    299
  ],
  "497": [
    250,
    10
  ],
  "498": [
    120,
    6
  ],
  "499": [
    8,
    27
  ],
  "500": [
    8,
    5
  ],
  "501": [
    2,
    9
  ],
  "502": [
    92,
    283
  ],
  "503": [
    228,
    1049236
  ],
  "504": [
    229,
    228
  ],
  "505": [
    465,
    146
  ],
  "506": [
    67,
    467
  ],
  "507": [
    325,
    433
  ],
  "508": [
    117,
    200
  ],
  "509": [
    191,
    220
  ],
  "510": [
    509,
    188
  ],
  "511": [
    6753,
    68
  ],
  "512": [
    285,
    78
  ],
  "513": [
    383,
    337
  ],
  "514": [
    333,
    333
  ],
  "515": [
    203,
    402
  ],
  "516": [
    61,
    1170
  ],
  "517": [
    1031,
    87
  ],
  "518": [
    6,
    8
  ],
  "519": [
    12338,
    12338
  ],
  "520": [
    137,
    46
  ],
  "521": [
    281,
    338
  ],
  "522": [
    213,
    185
  ],
  "523": [
    211,
    26
  ],
  "524": [
    218,
    24
  ],
  "525": [
    171,
    171
  ],
  "526": [
    1212,
    25
  ],
  "527": [
    397,
    0
  ],
  "528": [
    30,
    61
  ],
  "529": [
    55,
    3011301
  ],
  "530": [
    361,
    10
  ],
  "531": [
    128,
    22741
  ],
  "532": [
    353,
    353
  ],
  "533": [
    354,
    349
  ],
  "534": [
    524,
    290
  ],
  "535": [
    534,
    393
  ],
  "536": [
    52810,
    263
  ],
  "537": [
    1217660,
    443
  ],
  "538": [
    537,
    22741
  ],
  "539": [
    79,
    79
  ],
  "540": [
    90,
    95
  ],
  "541": [
    249,
    249
  ],
  "542": [
    1217539,
    79
  ],
  "543": [
    95,
    1440
  ],
  "544": [
    55,
    314
  ],
  "545": [
    233222,
    15
  ],
  "546": [
    57,
    55
  ],
  "547": [
    242,
    248
  ],
  "548": [
    140,
    140
  ],
  "549": [
    4,
    8180
  ],
  "550": [
    294,
    137
  ],
  "551": [
    453,
    385
  ],
  "552": [
    22237,
    439
  ],
  "553": [
    47,
    4
  ],
  "554": [
    111,
    8
  ],
  "555": [
    2330,
    63
  ],
  "556": [
    344,
    51763
  ],
  "557": [
    171,
    4
  ],
  "558": [
    344,
    220
  ],
  "559": [
    462,
    2220
  ],
  "560": [
    559,
    152
  ],
  "561": [
    12130,
    419
  ],
  "562": [
    561,
    53
  ],
  "563": [
    121779,
    252
  ],
  "564": [
    563,
    53
  ],
  "565": [
    253,
    420
  ],
  "566": [
    502,
    398
  ],
  "567": [
    566,
    122
  ],
  "568": [
    505,
    325
  ],
  "569": [
    568,
    506
  ],
  "570": [
    569,
    202
  ],
  "571": [
    570,
    507
  ],
  "572": [
    571,
    464
  ],
  "573": [
    508,
    503
  ],
  "574": [
    573,
    1987373
  ],
  "575": [
    574,
    504
  ],
  "576": [
    575,
    82
  ],
  "577": [
    576,
    1737309
  ],
  "578": [
    577,
    510
  ],
  "579": [
    286,
    512
  ],
  "580": [
    286,
    66
  ],
  "581": [
    137,
    50
  ],
  "582": [
    1,
    108
  ],
  "583": [
    1174920,
    526
  ],
  "584": [
    182,
    109
  ],
  "585": [
    1304,
    1304
  ],
  "586": [
    476,
    38
  ],
  "587": [
    61,
    432
  ],
  "588": [
    586,
    171
  ],
  "589": [
    211,
    15638
  ],
  "590": [
    46,
    23
  ],
  "591": [
    128,
    2270
  ],
  "592": [
    177,
    121
  ],
  "593": [
    120,
    186
  ],
  "594": [
    2,
    177
  ],
  "595": [
    10,
    270
  ],
  "596": [
    35450,
    35450
  ],
  "597": [
    3,
    2338
  ],
  "598": [
    379,
    75
  ],
  "599": [
    133,
    29
  ],
  "600": [
    131215638,
    194
  ],
  "601": [
    9,
    10
  ],
  "602": [
    23,
    490
  ],
  "603": [
    29,
    2330
  ],
  "604": [
    9,
    4
  ],
  "605": [
    55,
    128
  ],
  "606": [
    137,
    23
  ],
  "607": [
    6,
    220
  ],
  "608": [
    270,
    41
  ],
  "609": [
    186,
    5678
  ],
  "610": [
    163,
    729330
  ],
  "611": [
    494,
    521
  ],
  "612": [
    273,
    30
  ],
  "613": [
    176,
    6
  ],
  "614": [
    69,
    114411883
  ],
  "615": [
    2270,
    48
  ],
  "616": [
    143,
    275
  ],
  "617": [
    387,
    186
  ],
  "618": [
    121,
    66
  ],
  "619": [
    120,
    276
  ],
  "620": [
    357,
    357
  ],
  "621": [
    273,
    23
  ],
  "622": [
    136,
    2332226
  ],
  "623": [
    54,
    9
  ],
  "624": [
    126,
    126
  ],
  "625": [
    8,
    115
  ],
  "626": [
    48,
    241
  ],
  "627": [
    354,
    15176130334
  ],
  "628": [
    533,
    218
  ],
  "629": [
    226,
    250
  ],
  "630": [
    128,
    683
  ],
  "631": [
    538,
    538
  ],
  "632": [
    1328195116,
    1328195116
  ],
  "633": [
    273,
    253
  ],
  "634": [
    3,
    10
  ],
  "635": [
    356,
    356
  ],
  "636": [
    198,
    395
  ],
  "637": [
    71348212129366,
    12330
  ],
  "638": [
    2222,
    15
  ],
  "639": [
    307,
    8
  ],
  "640": [
    161,
    33332237
  ],
  "641": [
    29339,
    2172933235
  ],
  "642": [
    34,
    9
  ],
  "643": [
    3235,
    3235
  ],
  "644": [
    26,
    224
  ],
  "645": [
    227272727272727272720,
    227272727272727272720
  ],
  "646": [
    251,
    25
  ],
  "647": [
    30,
    551
  ],
  "648": [
    343,
    236
  ],
  "649": [
    128,
    6
  ],
  "650": [
    50,
    23
  ],
  "651": [
    120,
    7
  ],
  "652": [
    4750,
    3
  ],
  "653": [
    65,
    13348
  ],
  "654": [
    957,
    50
  ],
  "655": [
    273,
    197
  ],
  "656": [
    51763,
    558
  ],
  "657": [
    222,
    16
  ],
  "658": [
    567,
    122049
  ],
  "659": [
    658,
    1987
  ],
  "660": [
    659,
    125
  ],
  "661": [
    660,
    121803181844529
  ],
  "662": [
    578,
    1937309
  ],
  "663": [
    662,
    572
  ],
  "664": [
    166,
    511
  ],
  "665": [
    664,
    284955
  ],
  "666": [
    665,
    579
  ],
  "667": [
    1172,
    25
  ],
  "668": [
    7,
    270
  ],
  "669": [
    24,
    126
  ],
  "670": [
    656,
    235511
  ],
  "671": [
    7,
    4
  ],
  "672": [
    124,
    454
  ],
  "673": [
    304,
    304
  ],
  "674": [
    137,
    5
  ],
  "675": [
    1628,
    1628
  ],
  "676": [
    26601,
    618
  ],
  "677": [
    156,
    156
  ],
  "678": [
    363,
    5678
  ],
  "679": [
    22276,
    3
  ],
  "680": [
    1620,
    315
  ],
  "681": [
    635,
    275015
  ],
  "682": [
    681,
    84
  ],
  "683": [
    636,
    395
  ],
  "684": [
    67,
    203
  ],
  "685": [
    265,
    479
  ],
  "686": [
    120,
    23
  ],
  "687": [
    25,
    140
  ],
  "688": [
    135,
    330
  ],
  "689": [
    468,
    468
  ],
  "690": [
    134,
    4677
  ],
  "691": [
    227675,
    352
  ],
  "692": [
    5,
    2809
  ],
  "693": [
    294,
    294
  ],
  "694": [
    273,
    3
  ],
  "695": [
    123152,
    3124
  ],
  "696": [
    760483,
    597
  ],
  "697": [
    120,
    94
  ],
  "698": [
    267,
    607
  ],
  "699": [
    318,
    373
  ],
  "700": [
    516,
    4
  ],
  "701": [
    156,
    1170
  ],
  "702": [
    641,
    12330
  ],
  "703": [
    637,
    637
  ],
  "704": [
    9,
    220
  ],
  "705": [
    120,
    29
  ],
  "706": [
    6,
    2330
  ],
  "707": [
    69,
    7
  ],
  "708": [
    699,
    1765
  ],
  "709": [
    73,
    44
  ],
  "710": [
    27,
    303
  ],
  "711": [
    708,
    176
  ],
  "712": [
    1,
    113
  ],
  "713": [
    221,
    160
  ],
  "714": [
    407,
    186
  ],
  "715": [
    198,
    28
  ],
  "716": [
    7,
    50
  ],
  "717": [
    158,
    24
  ],
  "718": [
    278,
    674
  ],
  "719": [
    6,
    250
  ],
  "720": [
    27104,
    10
  ],
  "721": [
    88,
    133142
  ],
  "722": [
    53,
    3
  ],
  "723": [
    5,
    94
  ],
  "724": [
    1147,
    2330
  ],
  "725": [
    178,
    78
  ],
  "726": [
    86,
    31623
  ],
  "727": [
    1629528307,
    1629528307
  ],
  "728": [
    2757,
    131621
  ],
  "729": [
    276,
    2338
  ],
  "730": [
    65,
    1683
  ],
  "731": [
    324,
    13014495204
  ],
  "732": [
    648,
    30
  ],
  "733": [
    26,
    26
  ],
  "734": [
    217,
    217
  ],
  "735": [
    296,
    204
  ],
  "736": [
    735,
    6
  ],
  "737": [
    293,
    6
  ],
  "738": [
    360,
    360
  ],
  "739": [
    234,
    162
  ],
  "740": [
    133,
    6
  ],
  "741": [
    478,
    20
  ],
  "742": [
    1175,
    23
  ],
  "743": [
    25,
    89
  ],
  "744": [
    59,
    6
  ],
  "745": [
    1685,
    91303384
  ],
  "746": [
    535,
    535
  ],
  "747": [
    33436650,
    205685
  ],
  "748": [
    747,
    160
  ],
  "749": [
    409,
    549
  ],
  "750": [
    749,
    150
  ],
  "751": [
    12176235,
    70
  ],
  "752": [
    751,
    536
  ],
  "753": [
    752,
    447
  ],
  "754": [
    44716,
    9953338
  ],
  "755": [
    394,
    274098
  ],
  "756": [
    2330,
    70
  ],
  "757": [
    22730,
    70
  ],
  "758": [
    581,
    8
  ],
  "759": [
    27330,
    70
  ],
  "760": [
    759,
    207
  ],
  "761": [
    760,
    24177
  ],
  "762": [
    761,
    2330
  ],
  "763": [
    94,
    300
  ],
  "764": [
    763,
    116
  ],
  "765": [
    12338,
    116044
  ],
  "766": [
    765,
    4901804
  ],
  "767": [
    359,
    241
  ],
  "768": [
    767,
    204951804
  ],
  "769": [
    4983430,
    359
  ],
  "770": [
    769,
    729359
  ],
  "771": [
    770,
    246270
  ],
  "772": [
    120,
    2167150029330
  ],
  "773": [
    772,
    5
  ],
  "774": [
    773,
    224
  ],
  "775": [
    44,
    62515005
  ],
  "776": [
    775,
    5373235
  ],
  "777": [
    776,
    528129386
  ],
  "778": [
    6495180217235,
    3235
  ],
  "779": [
    778,
    668
  ],
  "780": [
    779,
    130566
  ],
  "781": [
    116,
    359
  ],
  "782": [
    781,
    270
  ],
  "783": [
    782,
    643
  ],
  "784": [
    44454,
    4905
  ],
  "785": [
    784,
    723
  ],
  "786": [
    22738,
    628160409
  ],
  "787": [
    786,
    2339
  ],
  "788": [
    644,
    246755
  ],
  "789": [
    122270,
    2568
  ],
  "790": [
    1880,
    256048
  ],
  "791": [
    591,
    50
  ],
  "792": [
    251308,
    22
  ],
  "793": [
    3942518,
    488
  ],
  "794": [
    149,
    22270
  ],
  "795": [
    794,
    25130
  ],
  "796": [
    128,
    252518
  ],
  "797": [
    796,
    448
  ],
  "798": [
    224130,
    4952819
  ],
  "799": [
    2121496045000,
    5281800
  ],
  "800": [
    799,
    3394
  ],
  "801": [
    800,
    170
  ],
  "802": [
    27330,
    603
  ],
  "803": [
    716,
    744
  ],
  "804": [
    803,
    224
  ],
  "805": [
    804,
    1418868
  ],
  "806": [
    805,
    70
  ],
  "807": [
    806,
    2373
  ],
  "808": [
    295431,
    1215130157
  ],
  "809": [
    808,
    1136760478
  ],
  "810": [
    128,
    448
  ],
  "811": [
    810,
    740
  ],
  "812": [
    811,
    263
  ],
  "813": [
    812,
    4177
  ],
  "814": [
    813,
    141447
  ],
  "815": [
    814,
    70
  ],
  "816": [
    2267195281281,
    142
  ],
  "817": [
    816,
    263
  ],
  "818": [
    817,
    94
  ],
  "819": [
    818,
    909
  ],
  "820": [
    819,
    121157
  ],
  "821": [
    820,
    8
  ],
  "822": [
    673739,
    374
  ],
  "823": [
    822,
    527
  ],
  "824": [
    11730,
    5
  ],
  "825": [
    2240,
    6945
  ],
  "826": [
    825,
    2801
  ],
  "827": [
    3680,
    104
  ],
  "828": [
    827,
    24
  ],
  "829": [
    828,
    104
  ],
  "830": [
    246,
    719
  ],
  "831": [
    830,
    6
  ],
  "832": [
    25,
    233568803
  ],
  "833": [
    832,
    55
  ],
  "834": [
    1309,
    270
  ],
  "835": [
    834,
    741
  ],
  "836": [
    2342,
    22044
  ],
  "837": [
    120,
    951804921
  ],
  "838": [
    837,
    24
  ],
  "839": [
    838,
    213189104
  ],
  "840": [
    839,
    7
  ],
  "841": [
    840,
    22750
  ],
  "842": [
    498,
    246
  ],
  "843": [
    842,
    674319
  ],
  "844": [
    843,
    275
  ],
  "845": [
    844,
    743
  ],
  "846": [
    845,
    2679
  ],
  "847": [
    294,
    241770
  ],
  "848": [
    27,
    14146
  ],
  "849": [
    848,
    270
  ],
  "850": [
    849,
    557
  ],
  "851": [
    683,
    25
  ],
  "852": [
    684,
    515
  ],
  "853": [
    310,
    310
  ],
  "854": [
    853,
    111624603
  ],
  "855": [
    600,
    600
  ],
  "856": [
    542,
    542
  ],
  "857": [
    176,
    10
  ],
  "858": [
    12338,
    2480
  ],
  "859": [
    55,
    1767
  ],
  "860": [
    9,
    90
  ],
  "861": [
    8,
    226873
  ],
  "862": [
    124923,
    86
  ],
  "863": [
    12338,
    2270
  ],
  "864": [
    2,
    103
  ],
  "865": [
    120,
    250
  ],
  "866": [
    182,
    182
  ],
  "867": [
    2338,
    1312156152
  ],
  "868": [
    50,
    3
  ],
  "869": [
    9,
    73
  ],
  "870": [
    91303384,
    91303384
  ],
  "871": [
    11497,
    11497
  ],
  "872": [
    121768,
    378
  ],
  "873": [
    56773,
    91761464
  ],
  "874": [
    10,
    227272727272727272727272217637
  ],
  "875": [
    10,
    22727272727272727272727228
  ],
  "876": [
    186,
    873
  ],
  "877": [
    170,
    25
  ],
  "878": [
    593,
    51062
  ],
  "879": [
    345,
    435
  ],
  "880": [
    560,
    560
  ],
  "881": [
    147,
    7144
  ],
  "882": [
    1312211750,
    8
  ],
  "883": [
    562,
    562
  ],
  "884": [
    564,
    564
  ],
  "885": [
    463,
    355359
  ],
  "886": [
    565,
    248
  ],
  "887": [
    580,
    285
  ],
  "888": [
    887,
    286
  ],
  "889": [
    888,
    6753720
  ],
  "890": [
    889,
    238
  ],
  "891": [
    890,
    1176345
  ],
  "892": [
    65,
    1338
  ],
  "893": [
    7,
    540
  ],
  "894": [
    99,
    261
  ],
  "895": [
    246,
    69
  ],
  "896": [
    87,
    51
  ],
  "897": [
    666,
    23
  ],
  "898": [
    1329344515,
    21308
  ],
  "899": [
    543,
    543
  ],
  "900": [
    389,
    389
  ],
  "901": [
    312,
    312
  ],
  "902": [
    737,
    188
  ],
  "903": [
    902,
    68
  ],
  "904": [
    496,
    496
  ],
  "905": [
    7531620,
    670
  ],
  "906": [
    691,
    2671215
  ],
  "907": [
    12757,
    141
  ],
  "908": [
    207,
    2303
  ],
  "909": [
    13162,
    102
  ],
  "910": [
    81,
    450
  ],
  "911": [
    51,
    602
  ],
  "912": [
    1174,
    9
  ],
  "913": [
    141,
    85
  ],
  "914": [
    676,
    277
  ],
  "915": [
    128,
    135
  ],
  "916": [
    169,
    1102
  ],
  "917": [
    137,
    27338
  ],
  "918": [
    26,
    2220
  ],
  "919": [
    156,
    955
  ],
  "920": [
    2270,
    241
  ],
  "921": [
    919,
    156
  ],
  "922": [
    272727274826,
    272727274826
  ],
  "923": [
    583,
    583
  ],
  "924": [
    914,
    513
  ],
  "925": [
    924,
    73
  ],
  "926": [
    6,
    24
  ],
  "927": [
    159,
    114
  ],
  "928": [
    365,
    365
  ],
  "929": [
    625,
    544
  ],
  "930": [
    859,
    93
  ],
  "931": [
    614,
    614
  ],
  "932": [
    81844514,
    270
  ],
  "933": [
    851,
    96
  ],
  "934": [
    725,
    854
  ],
  "935": [
    22727272727272720,
    22727272727272720
  ],
  "936": [
    1278,
    20
  ],
  "937": [
    176,
    3
  ],
  "938": [
    306,
    306
  ],
  "939": [
    88,
    1330
  ],
  "940": [
    142,
    3
  ],
  "941": [
    3681306,
    3681306
  ],
  "942": [
    698,
    230
  ],
  "943": [
    104,
    194
  ],
  "944": [
    126,
    2332226
  ],
  "945": [
    268,
    2130
  ],
  "946": [
    13124,
    280
  ],
  "947": [
    5,
    128
  ],
  "948": [
    143,
    148
  ],
  "949": [
    5188678,
    186
  ],
  "950": [
    611,
    860
  ],
  "951": [
    305,
    4684
  ],
  "952": [
    296,
    296
  ],
  "953": [
    12330,
    270
  ],
  "954": [
    126,
    22226
  ],
  "955": [
    89,
    270
  ],
  "956": [
    713,
    2818
  ],
  "957": [
    3349211,
    207
  ],
  "958": [
    957,
    908
  ],
  "959": [
    10,
    1017716
  ],
  "960": [
    157,
    8
  ],
  "961": [
    617,
    949
  ],
  "962": [
    491,
    491
  ],
  "963": [
    91761444,
    91761444
  ],
  "964": [
    257,
    257
  ],
  "965": [
    324,
    130204
  ],
  "966": [
    151,
    731
  ],
  "967": [
    471,
    117204
  ],
  "968": [
    1172,
    732
  ],
  "969": [
    337,
    383
  ],
  "970": [
    724,
    724
  ],
  "971": [
    29,
    2338
  ],
  "972": [
    25518501106,
    33
  ],
  "973": [
    276,
    134
  ],
  "974": [
    270,
    254
  ],
  "975": [
    241,
    10
  ],
  "976": [
    131,
    2330
  ],
  "977": [
    1,
    162
  ],
  "978": [
    27142,
    12334990
  ],
  "979": [
    587,
    587
  ],
  "980": [
    726,
    726
  ],
  "981": [
    728,
    728
  ],
  "982": [
    279,
    1336
  ],
  "983": [
    88,
    1338
  ],
  "984": [
    22,
    1302
  ],
  "985": [
    128,
    254
  ],
  "986": [
    652,
    655
  ],
  "987": [
    12330,
    116
  ],
  "988": [
    2270,
    46
  ],
  "989": [
    65,
    133330
  ],
  "990": [
    556,
    704
  ],
  "991": [
    250,
    8
  ],
  "992": [
    2276734,
    8
  ],
  "993": [
    865182,
    992
  ],
  "994": [
    36,
    2795332720
  ],
  "995": [
    408,
    7150
  ],
  "996": [
    408,
    144
  ],
  "997": [
    120,
    227951303389
  ],
  "998": [
    12338,
    24
  ],
  "999": [
    331626,
    311
  ],
  "1000": [
    145,
    145
  ],
  "1001": [
    121768,
    921
  ],
  "1002": [
    1233500124,
    37
  ],
  "1003": [
    1002,
    546
  ],
  "1004": [
    639,
    295
  ],
  "1005": [
    151,
    683
  ],
  "1006": [
    683,
    1170
  ],
  "1007": [
    700,
    724150
  ],
  "1008": [
    1245,
    7
  ],
  "1009": [
    584,
    584
  ],
  "1010": [
    0,
    270
  ],
  "1011": [
    299,
    299
  ],
  "1012": [
    2330,
    7
  ],
  "1013": [
    44,
    8
  ],
  "1014": [
    952938,
    120
  ],
  "1015": [
    213,
    213
  ],
  "1016": [
    25,
    115
  ],
  "1017": [
    10,
    4
  ],
  "1018": [
    171,
    52
  ],
  "1019": [
    529,
    128
  ],
  "1020": [
    217,
    93
  ],
  "1021": [
    2124,
    2124
  ],
  "1022": [
    729335,
    729330
  ],
  "1023": [
    1217637,
    163
  ],
  "1024": [
    241,
    8
  ],
  "1025": [
    89,
    24
  ],
  "1026": [
    315,
    315
  ],
  "1027": [
    212,
    20
  ],
  "1028": [
    137,
    274
  ],
  "1029": [
    61,
    1981
  ],
  "1030": [
    233,
    41
  ],
  "1031": [
    484,
    484
  ],
  "1032": [
    45,
    183
  ],
  "1033": [
    2272727272727272727272727272782,
    2272727272727272727272727272782
  ],
  "1034": [
    2272720,
    337
  ],
  "1035": [
    627,
    627
  ],
  "1036": [
    628,
    628
  ],
  "1037": [
    301130334,
    8
  ],
  "1038": [
    487,
    15176130334
  ],
  "1039": [
    7650,
    2051
  ],
  "1040": [
    332,
    1016
  ],
  "1041": [
    750,
    21769
  ],
  "1042": [
    330,
    298
  ],
  "1043": [
    758,
    21770
  ],
  "1044": [
    1043,
    92077
  ],
  "1045": [
    2332276736,
    2980
  ],
  "1046": [
    757,
    9529330
  ],
  "1047": [
    1046,
    2270
  ],
  "1048": [
    1047,
    3345000
  ],
  "1049": [
    1048,
    94
  ],
  "1050": [
    62,
    224
  ],
  "1051": [
    1050,
    25006041770
  ],
  "1052": [
    1051,
    50
  ],
  "1053": [
    29,
    952938
  ],
  "1054": [
    1053,
    667431
  ],
  "1055": [
    1054,
    59
  ],
  "1056": [
    513030,
    70
  ],
  "1057": [
    1056,
    287
  ],
  "1058": [
    1057,
    2684
  ],
  "1059": [
    1058,
    94
  ],
  "1060": [
    1175,
    8293368
  ],
  "1061": [
    1060,
    8180
  ],
  "1062": [
    1061,
    2241
  ],
  "1063": [
    756,
    27492177
  ],
  "1064": [
    1063,
    1012
  ],
  "1065": [
    121593160,
    51804
  ],
  "1066": [
    1065,
    951629
  ],
  "1067": [
    1066,
    70
  ],
  "1068": [
    755,
    21770
  ],
  "1069": [
    650,
    644
  ],
  "1070": [
    48,
    988
  ],
  "1071": [
    768,
    2274675564921
  ],
  "1072": [
    1071,
    2468
  ],
  "1073": [
    783,
    270
  ],
  "1074": [
    785,
    692
  ],
  "1075": [
    1074,
    7
  ],
  "1076": [
    1075,
    56044
  ],
  "1077": [
    787,
    94
  ],
  "1078": [
    1077,
    5281634
  ],
  "1079": [
    4951804,
    22
  ],
  "1080": [
    1079,
    224
  ],
  "1081": [
    1080,
    788
  ],
  "1082": [
    121765373869,
    2334
  ],
  "1083": [
    1082,
    2130235
  ],
  "1084": [
    145010130,
    26903
  ],
  "1085": [
    25130,
    809
  ],
  "1086": [
    371,
    1025
  ],
  "1087": [
    328,
    798
  ],
  "1088": [
    797,
    87
  ],
  "1089": [
    1088,
    70
  ],
  "1090": [
    1089,
    2116
  ],
  "1091": [
    1090,
    330
  ],
  "1092": [
    1091,
    25
  ],
  "1093": [
    795,
    29537360478
  ],
  "1094": [
    1093,
    252518
  ],
  "1095": [
    793,
    3157
  ],
  "1096": [
    1095,
    232876730
  ],
  "1097": [
    791,
    26667113
  ],
  "1098": [
    1097,
    53
  ],
  "1099": [
    1098,
    792
  ],
  "1100": [
    789,
    825138
  ],
  "1101": [
    1100,
    790
  ],
  "1102": [
    246,
    823
  ],
  "1103": [
    1102,
    5
  ],
  "1104": [
    824,
    21305
  ],
  "1105": [
    1104,
    23
  ],
  "1106": [
    1105,
    41
  ],
  "1107": [
    1106,
    826
  ],
  "1108": [
    126,
    2298
  ],
  "1109": [
    1108,
    2335
  ],
  "1110": [
    1109,
    21770
  ],
  "1111": [
    1278,
    21376
  ],
  "1112": [
    1111,
    26796036
  ],
  "1113": [
    1030,
    259
  ],
  "1114": [
    1113,
    70
  ],
  "1115": [
    1114,
    45830105572414
  ],
  "1116": [
    1115,
    251
  ],
  "1117": [
    246,
    2718017615671681
  ],
  "1118": [
    1117,
    270
  ],
  "1119": [
    1118,
    4681301529331801
  ],
  "1120": [
    742,
    41770
  ],
  "1121": [
    1120,
    2270
  ],
  "1122": [
    1121,
    2293445
  ],
  "1123": [
    1122,
    847
  ],
  "1124": [
    846,
    374
  ],
  "1125": [
    841,
    4130
  ],
  "1126": [
    1125,
    35
  ],
  "1127": [
    374,
    104
  ],
  "1128": [
    451,
    238
  ],
  "1129": [
    1233217,
    54
  ],
  "1130": [
    1129,
    246
  ],
  "1131": [
    1226738,
    22741
  ],
  "1132": [
    630,
    30
  ],
  "1133": [
    125004,
    290954
  ],
  "1134": [
    531,
    227273
  ],
  "1135": [
    1134,
    528
  ],
  "1136": [
    114,
    54
  ],
  "1137": [
    1136,
    85
  ],
  "1138": [
    5211,
    75181
  ],
  "1139": [
    145,
    73
  ],
  "1140": [
    951,
    12330
  ],
  "1141": [
    1140,
    305
  ],
  "1142": [
    143,
    1330
  ],
  "1143": [
    598,
    932
  ],
  "1144": [
    852,
    934
  ],
  "1145": [
    14266,
    513
  ],
  "1146": [
    7,
    73
  ],
  "1147": [
    65,
    133104
  ],
  "1148": [
    8,
    65
  ],
  "1149": [
    24684,
    6
  ],
  "1150": [
    95,
    138500
  ],
  "1151": [
    5,
    120
  ],
  "1152": [
    198,
    234
  ],
  "1153": [
    19815,
    2116
  ],
  "1154": [
    936,
    29
  ],
  "1155": [
    985,
    5373
  ],
  "1156": [
    43,
    950
  ],
  "1157": [
    1153,
    104
  ],
  "1158": [
    1149,
    2778
  ],
  "1159": [
    3716,
    943
  ],
  "1160": [
    108,
    0
  ],
  "1161": [
    867,
    867
  ],
  "1162": [
    13124,
    227271415638
  ],
  "1163": [
    1145,
    861
  ],
  "1164": [
    144,
    124
  ],
  "1165": [
    1158,
    20
  ],
  "1166": [
    22049551,
    974
  ],
  "1167": [
    1159,
    104
  ],
  "1168": [
    39412156014,
    6604
  ],
  "1169": [
    1154,
    6604926
  ],
  "1170": [
    120,
    523
  ],
  "1171": [
    1157,
    62
  ],
  "1172": [
    117121235,
    1414667
  ],
  "1173": [
    1155,
    362
  ],
  "1174": [
    241895,
    231765
  ],
  "1175": [
    128,
    87
  ],
  "1176": [
    1168,
    355
  ],
  "1177": [
    1163,
    1763
  ],
  "1178": [
    1167,
    300
  ],
  "1179": [
    1165,
    264
  ],
  "1180": [
    1171,
    253
  ],
  "1181": [
    1169,
    60830
  ],
  "1182": [
    1172,
    71883
  ],
  "1183": [
    81,
    22789
  ],
  "1184": [
    1176,
    34456
  ],
  "1185": [
    1173,
    245
  ],
  "1186": [
    759,
    21766676014
  ],
  "1187": [
    1181,
    940
  ],
  "1188": [
    1186,
    44
  ],
  "1189": [
    2222757,
    12757
  ],
  "1190": [
    547,
    242
  ],
  "1191": [
    1170,
    2352
  ],
  "1192": [
    1185,
    1139
  ],
  "1193": [
    1187,
    136344
  ],
  "1194": [
    1192,
    6146
  ],
  "1195": [
    15630,
    912129359
  ],
  "1196": [
    547,
    1190
  ],
  "1197": [
    415,
    115
  ],
  "1198": [
    115,
    164
  ],
  "1199": [
    12130,
    2330
  ],
  "1200": [
    128,
    8
  ],
  "1201": [
    180,
    4
  ],
  "1202": [
    242,
    8
  ],
  "1203": [
    993,
    993
  ],
  "1204": [
    149,
    6
  ],
  "1205": [
    24,
    302
  ],
  "1206": [
    8,
    6
  ],
  "1207": [
    407,
    588
  ],
  "1208": [
    27,
    5
  ],
  "1209": [
    135,
    220
  ],
  "1210": [
    7144,
    30
  ],
  "1211": [
    128,
    133142
  ],
  "1212": [
    72813,
    3
  ],
  "1213": [
    54,
    317
  ],
  "1214": [
    881,
    2223124
  ],
  "1215": [
    26750,
    8
  ],
  "1216": [
    1215,
    2223122116
  ],
  "1217": [
    882,
    1210
  ],
  "1218": [
    346,
    737346
  ],
  "1219": [
    1218,
    737346
  ],
  "1220": [
    1219,
    79
  ],
  "1221": [
    1220,
    396
  ],
  "1222": [
    12177373,
    64
  ],
  "1223": [
    346,
    722
  ],
  "1224": [
    1223,
    113
  ],
  "1225": [
    12803,
    3
  ],
  "1226": [
    1225,
    419
  ],
  "1227": [
    4560463,
    885
  ],
  "1228": [
    152054,
    554
  ],
  "1229": [
    1228,
    155
  ],
  "1230": [
    155,
    420
  ],
  "1231": [
    1230,
    554
  ],
  "1232": [
    1231,
    1520584
  ],
  "1233": [
    155,
    152054
  ],
  "1234": [
    1233,
    242
  ],
  "1235": [
    92,
    100
  ],
  "1236": [
    661,
    661
  ],
  "1237": [
    663,
    663
  ],
  "1238": [
    188753338,
    83
  ],
  "1239": [
    220,
    216
  ],
  "1240": [
    666,
    891
  ],
  "1241": [
    137,
    227272727804
  ],
  "1242": [
    137,
    2272727271300
  ],
  "1243": [
    1177,
    905
  ],
  "1244": [
    133,
    87
  ],
  "1245": [
    1102,
    137430
  ],
  "1246": [
    22,
    130
  ],
  "1247": [
    1197,
    1014
  ],
  "1248": [
    171,
    5678
  ],
  "1249": [
    391,
    391
  ],
  "1250": [
    126,
    211525
  ],
  "1251": [
    15630,
    380
  ],
  "1252": [
    23,
    9
  ],
  "1253": [
    8,
    9
  ],
  "1254": [
    67,
    74
  ],
  "1255": [
    44,
    104
  ],
  "1256": [
    22741,
    22741
  ],
  "1257": [
    182,
    23
  ],
  "1258": [
    43,
    1170
  ],
  "1259": [
    342,
    7
  ],
  "1260": [
    2,
    120
  ],
  "1261": [
    996,
    212171
  ],
  "1262": [
    1261,
    250
  ],
  "1263": [
    26713,
    550
  ],
  "1264": [
    21246,
    273
  ],
  "1265": [
    110144,
    37
  ],
  "1266": [
    1233499757,
    1233499757
  ],
  "1267": [
    910,
    910
  ],
  "1268": [
    233222330,
    911
  ],
  "1269": [
    2222752930,
    2222752930
  ],
  "1270": [
    633,
    1258
  ],
  "1271": [
    984,
    2272720
  ],
  "1272": [
    2272782,
    227276736013
  ],
  "1273": [
    176,
    7
  ],
  "1274": [
    50,
    4
  ],
  "1275": [
    107,
    20
  ],
  "1276": [
    12330,
    341
  ],
  "1277": [
    167,
    86
  ],
  "1278": [
    1141,
    1141
  ],
  "1279": [
    157,
    157
  ],
  "1280": [
    1162,
    1162
  ],
  "1281": [
    74,
    489
  ],
  "1282": [
    339,
    153
  ],
  "1283": [
    133,
    51
  ],
  "1284": [
    314,
    930
  ],
  "1285": [
    696,
    696
  ],
  "1286": [
    12330,
    673
  ],
  "1287": [
    917,
    917
  ],
  "1288": [
    2,
    171
  ],
  "1289": [
    994,
    994
  ],
  "1290": [
    120,
    320
  ],
  "1291": [
    160,
    5
  ],
  "1292": [
    165,
    689
  ],
  "1293": [
    7,
    18120613
  ],
  "1294": [
    1775,
    500
  ],
  "1295": [
    893,
    1466
  ],
  "1296": [
    452,
    75
  ],
  "1297": [
    2144,
    2144
  ],
  "1298": [
    73,
    366
  ],
  "1299": [
    925,
    1213
  ],
  "1300": [
    101300,
    611303384
  ],
  "1301": [
    12330,
    5
  ],
  "1302": [
    126,
    622
  ],
  "1303": [
    233222,
    129
  ],
  "1304": [
    4121334,
    65
  ],
  "1305": [
    0,
    3
  ],
  "1306": [
    143,
    133104
  ],
  "1307": [
    479,
    685
  ],
  "1308": [
    12330,
    21217
  ],
  "1309": [
    20,
    2270
  ],
  "1310": [
    1299,
    556
  ],
  "1311": [
    135,
    135
  ],
  "1312": [
    22720,
    135
  ],
  "1313": [
    913057601,
    1143
  ],
  "1314": [
    2720,
    598
  ],
  "1315": [
    933,
    1437338
  ],
  "1316": [
    1315,
    106
  ],
  "1317": [
    1316,
    338
  ],
  "1318": [
    1317,
    106
  ],
  "1319": [
    1318,
    23
  ],
  "1320": [
    1319,
    20573
  ],
  "1321": [
    1144,
    515
  ],
  "1322": [
    1321,
    273
  ],
  "1323": [
    144,
    3
  ],
  "1324": [
    72,
    35
  ],
  "1325": [
    1310,
    942
  ],
  "1326": [
    1325,
    9
  ],
  "1327": [
    640,
    640
  ],
  "1328": [
    160637,
    246
  ],
  "1329": [
    1328,
    1005
  ],
  "1330": [
    1006,
    201
  ],
  "1331": [
    67489,
    67489
  ],
  "1332": [
    269,
    23
  ],
  "1333": [
    351,
    351
  ],
  "1334": [
    3144,
    647
  ],
  "1335": [
    152,
    382
  ],
  "1336": [
    152,
    647
  ],
  "1337": [
    16049271,
    16049271
  ],
  "1338": [
    966,
    966
  ],
  "1339": [
    967,
    967
  ],
  "1340": [
    22285,
    334
  ],
  "1341": [
    552,
    552
  ],
  "1342": [
    126,
    61461461461462
  ],
  "1343": [
    154,
    12757
  ],
  "1344": [
    8,
    222115
  ],
  "1345": [
    195,
    81
  ],
  "1346": [
    2222,
    129
  ],
  "1347": [
    2,
    137
  ],
  "1348": [
    69,
    197
  ],
  "1349": [
    121762,
    259
  ],
  "1350": [
    335,
    335
  ],
  "1351": [
    1326,
    235511
  ],
  "1352": [
    29,
    6
  ],
  "1353": [
    862,
    862
  ],
  "1354": [
    4,
    85
  ],
  "1355": [
    12330,
    44
  ],
  "1356": [
    1336,
    2338
  ],
  "1357": [
    115,
    145
  ],
  "1358": [
    160,
    6
  ],
  "1359": [
    1351,
    956
  ],
  "1360": [
    871260,
    121768
  ],
  "1361": [
    1252,
    1772
  ],
  "1362": [
    10,
    101
  ],
  "1363": [
    10,
    295
  ],
  "1364": [
    982,
    115
  ],
  "1365": [
    222,
    129
  ],
  "1366": [
    714,
    878
  ],
  "1367": [
    1360,
    375001062
  ],
  "1368": [
    130334,
    763413034
  ],
  "1369": [
    1368,
    8
  ],
  "1370": [
    1298,
    4925
  ],
  "1371": [
    227130334,
    44
  ],
  "1372": [
    1264,
    550
  ],
  "1373": [
    997,
    997
  ],
  "1374": [
    133757,
    110
  ],
  "1375": [
    7,
    23
  ],
  "1376": [
    12338,
    101
  ],
  "1377": [
    14287,
    14287
  ],
  "1378": [
    1606,
    2936
  ],
  "1379": [
    1207,
    5678
  ],
  "1380": [
    718,
    1385
  ],
  "1381": [
    126,
    136
  ],
  "1382": [
    119,
    22
  ],
  "1383": [
    961,
    51886773
  ],
  "1384": [
    1359,
    969
  ],
  "1385": [
    7,
    78
  ],
  "1386": [
    25,
    26
  ],
  "1387": [
    268,
    28
  ],
  "1388": [
    279,
    133254
  ],
  "1389": [
    116,
    38
  ],
  "1390": [
    1378,
    131766
  ],
  "1391": [
    127814682,
    104413
  ],
  "1392": [
    113,
    255
  ],
  "1393": [
    680,
    680
  ],
  "1394": [
    26,
    22226
  ],
  "1395": [
    1379,
    588
  ],
  "1396": [
    875,
    610
  ],
  "1397": [
    874,
    163
  ],
  "1398": [
    876,
    678
  ],
  "1399": [
    585011761464,
    609
  ],
  "1400": [
    363,
    3942
  ],
  "1401": [
    1400,
    363
  ],
  "1402": [
    1401,
    51881065011761464
  ],
  "1403": [
    12338,
    194
  ],
  "1404": [
    117,
    612
  ],
  "1405": [
    590,
    2330
  ],
  "1406": [
    1384,
    972
  ],
  "1407": [
    909,
    909
  ],
  "1408": [
    10,
    1309
  ],
  "1409": [
    120,
    582
  ],
  "1410": [
    1409,
    2933338
  ],
  "1411": [
    289,
    29
  ],
  "1412": [
    28784,
    44
  ],
  "1413": [
    1393,
    684
  ],
  "1414": [
    1363,
    71
  ],
  "1415": [
    522,
    124
  ],
  "1416": [
    25,
    1984
  ],
  "1417": [
    6,
    66
  ],
  "1418": [
    2757,
    126
  ],
  "1419": [
    863,
    863
  ],
  "1420": [
    15492,
    86
  ],
  "1421": [
    212,
    0
  ],
  "1422": [
    1395,
    56773
  ],
  "1423": [
    2,
    12330
  ],
  "1424": [
    259,
    265
  ],
  "1425": [
    1494,
    317
  ],
  "1426": [
    1191,
    1191
  ],
  "1427": [
    149,
    1415
  ],
  "1428": [
    2,
    126
  ],
  "1429": [
    68,
    81440
  ],
  "1430": [
    10,
    1292
  ],
  "1431": [
    312,
    612067092
  ],
  "1432": [
    84,
    736
  ],
  "1433": [
    1385,
    671
  ],
  "1434": [
    1433,
    80
  ],
  "1435": [
    138,
    12177445
  ],
  "1436": [
    540,
    594
  ],
  "1437": [
    1294,
    13445
  ],
  "1438": [
    592,
    592
  ],
  "1439": [
    522,
    4419
  ],
  "1440": [
    1439,
    1427
  ],
  "1441": [
    1440,
    109
  ],
  "1442": [
    10,
    24
  ],
  "1443": [
    2272,
    21217
  ],
  "1444": [
    906,
    906
  ],
  "1445": [
    120,
    2
  ],
  "1446": [
    182046349,
    182046349
  ],
  "1447": [
    245,
    270
  ],
  "1448": [
    8,
    7
  ],
  "1449": [
    130130334,
    73
  ],
  "1450": [
    1406,
    990
  ],
  "1451": [
    1450,
    999
  ],
  "1452": [
    48,
    220
  ],
  "1453": [
    76,
    126
  ],
  "1454": [
    8,
    109
  ],
  "1455": [
    1266,
    7
  ],
  "1456": [
    55,
    194
  ],
  "1457": [
    64,
    101
  ],
  "1458": [
    2273,
    290
  ],
  "1459": [
    116,
    2748
  ],
  "1460": [
    2694,
    443
  ],
  "1461": [
    61,
    10
  ],
  "1462": [
    1451,
    2660497
  ],
  "1463": [
    3018,
    13204
  ],
  "1464": [
    121763109,
    121763109
  ],
  "1465": [
    1241,
    1241
  ],
  "1466": [
    1242,
    1242
  ],
  "1467": [
    54,
    21881884
  ],
  "1468": [
    168121334,
    73
  ],
  "1469": [
    1247,
    1247
  ],
  "1470": [
    235,
    3
  ],
  "1471": [
    1772,
    113
  ],
  "1472": [
    12176,
    2338
  ],
  "1473": [
    287,
    76
  ],
  "1474": [
    69,
    2270
  ],
  "1475": [
    1370,
    1370
  ],
  "1476": [
    27330,
    4809
  ],
  "1477": [
    128,
    133104
  ],
  "1478": [
    1250,
    1250
  ],
  "1479": [
    29,
    1491
  ],
  "1480": [
    131,
    233220
  ],
  "1481": [
    12330,
    9
  ],
  "1482": [
    65,
    1130
  ],
  "1483": [
    22228,
    217152
  ],
  "1484": [
    41804,
    45
  ],
  "1485": [
    176124,
    37
  ],
